Revit 2027 API
ParameterTypeId.RbsReferenceLiningType Property
 "Lining Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsReferenceLiningType { get; }
Public Shared ReadOnly Property RbsReferenceLiningType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsReferenceLiningType {
	ForgeTypeId^ get ();
}
static member RbsReferenceLiningType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace